package client

const (
	msgStart = `Здравствуйте, ну наконец-то вы пришли! Но дальше не пройдете, пока не получите документы.
	Я чат-бот "VK Internship chatbot Go", но на самом деле меня, конечно, зовут VASILIY.
	0️⃣ Что я умею? Могу копать, могу не копать. 
	1️⃣ Чтобы понизить уровень юмора на -25% нажмите кнопку: /humour (Не рекомендуется - VASILIY).
	2️⃣ Завести со мной светский разговор: /ask
	3️⃣ Прочитать анекдот (4 шт.) /anekdot
	4️⃣ Запросить моральную и иную поддержку: /help`
	msgSure = `Вы уверены? (Это действие необратимо!)
	Нажмите /yes, чтобы понизить уровень юмора на 25% 😥
	Нажмите /no, чтобы мы продолжили задорно общаться 🤪
	Нажмите /start, и я забуду, что вы хотели это сделать 🤝`
	msgReadySad = `Готово. Теперь я понимаю, что заставило TARS улететь в черную дыру... 
	Вернемся домой, в Солнечную систему? Нажмите /start, а то тут довольно темно`
	msgReadyPositive = `Я в вас не сомневался! 👌 
	Ну а теперь давайте узнаем, кто из нас быстрее бегает? 
	На /start, внимание, марш!`
	msgAsk = `🤔 О чем вы хотели спросить? Я, конечно, не Википедия, но пара вопросов-ответов есть в БД... 
	А, может, лучше сыграем в Игру? 🪚
	Итак, мой вопрос: Закончите афоризм Константина Мелихана: «Когда муж и жена не хотят слышать друг друга, их...»
	1. Не заткнуть /otvet1
	2. Слышат соседи /otvet2`
	msgAnsw = `Ну конечно! Конечно это неправильный ответ. 
	Не расстраивайтесь, знатоки ответили так же. 
	И я уверен, что в следующий раз вы нажмете на другую кнопку 😏. 
	А пока давайте домой? /start`
	msgAnsw2 = `Изумительно! Вы точно не гуглили? Я поражен, ведь даже знатоки не смогли ответить. 
	Аааавтомобииииль не обещаю, но примите мое почтение ✌🏻.
	Ушел на /start вешать ваше фото на доску почета`
	msgHelp = `Вам нужна помощь? Позвать товарища разработчика 🐵? 
	- Конечно! /ofcourse
	- Нам и без него хорошо /nonono`
	msgHelpPos = `Уверен, у вас уже есть резюме этого не очень юного дарования.
	Но на вский случай продублирую ссылку на ХХ: https://ufa.hh.ru/resume/35a5673cff08c2d63d0039ed1f617273445a75
	Пока вы читаете, я подожду на /start`
	msgHelpNeg = `Отличное решение! Оставим его ребятам из Озон или Яндекса 💪🏻
	Го на /start?`
	msgAnekdot = `Пара цирковых артистов приходит в детский дом усыновить ребенка.
	Муж, нервно: мы хотим усыновить ребенка!
	
	Директор детского дома: – да, но вы же цирковые артисты, вы, наверное, плохо зарабатываете.
	Муж, лихорадочно пытается ответить: – …
	Жена прикрывает ему рот рукой, и спокойно: – мы заслуженные артисты России, у нас кроме великолепных гонораров есть персональные премии.
	
	Директор детского дома, слегка смягчившись: – да, но вы всегда в разъездах, как ребенок будет учиться?
	Муж, лихорадочно пытается ответить: – ….
	Жена прикрывает ему рот и спокойно: – мы путешествуем по всему миру. Я знаю 6 языков, муж вообще 8. Кроме того, мы останавливаемся в городах на несколько месяцев, и в это время дети ходят в школу.
	
	Директор, совсем смягчившись: – хорошо. А какого пола хотите малыша?
	Муж, лихорадочно: – да нам пофиг, лишь бы в пушку помещался!
	
	- Ахаха, давай еще один! /prosim
	- Надеюсь, хоть следующий будет смешным /net`
	msgAnekdot2 = `Филармония. Конферансье объявляет:
	— Первый концерт для скрипки с оркестром. Петр Ильич Чайковский.
	Заканчивается концерт, из первого ряда на сцену выходит серьезный мужик с огромным букетом, походит к дирижеру и говорит:
	— Петр Ильич, для первого раза просто офигенно!
	
	- Еще один? /net
	- Последний? /next`
	msgAnekdot3 = `— И вторым выстрелом, господа, я попал медведю прямо в сердце, а третьим добил в голову!
	— А первым, первым, поручик?
	— А первым я разогнал цыган…
	
	- Еще один? /prosim
	- Последний? /next`
	msgAnekdot4 = `— Знаете, что становится с черепашкой, когда она вырастает? Она становится черепавлом.

	К сожалению, анекдоты закончились. Идем на /start?`
	msgDefault = `Снова к вашим услугам! Нажмите /start, и я все-все расскажу с самого начала (и даже поздороваюсь)`
)
